### Terraform `plan` Succeeded for Directory `terraform`
<details open><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_s3_bucket.my_test_bucket will be created
+   resource "aws_s3_bucket" "my_test_bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "my_test_bucket_checkov"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "Application" = "my_test_app10"
+           "Name"        = "my_test_bucket_checkov"
        }
+       tags_all                    = {
+           "Application" = "my_test_app10"
+           "Name"        = "my_test_bucket_checkov"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_acl.temp_files_api_acl will be created
+   resource "aws_s3_bucket_acl" "temp_files_api_acl" {
+       acl    = "private"
+       bucket = (known after apply)
+       id     = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>